---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StringParameterValue Constructor
StringParameterValue Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | StringParameterValue()()()() | Default constructor |
|  | StringParameterValue(String) | Value constructor |

# See Also

StringParameterValue Class

StringParameterValue Members

Autodesk.Revit.DB Namespace